Транслятор_запросав_SQL/src/Catalogs/БазыДанных/БазыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БазыДанных</name>
  <attributes>
    <name>ИмяSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Транслятор_запросав_SQL/src/Catalogs/Методанные1С/Методанные1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Методанные1С</name>
  <comment>Объекты конфигурации</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.БазыДанных</owners>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТаблицыХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Транслятор_запросав_SQL/src/Catalogs/Поля/Поля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Поля</name>
  <owners>Catalog.Методанные1С</owners>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТаблицыХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Транслятор_запросав_SQL/src/Catalogs/БазыДанных/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура УдалитьСтруктуру(Команда)
	УдалитьСтруктуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьСтруктуруНаСервере()
	СтруктураДанныхСервер.УдалитьСтруктуруНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтруктуруБД(Команда)
	Если ЭтаФорма.Модифицированность Тогда
		Сообщить("Сначала запишите данные");
	Иначе
		ЗаполнитьСтруктуруБДНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруБДНаСервере()

	СтруктураДанныхСервер.УдалитьСтруктуруНаСервере(Ложь);

	СтруктураДанныхСервер.ЗаполнитьДеревоМД(Объект.Ссылка);

	СтруктураХраненияБазыДанных = ПолучитьСтруктуруХраненияБазыДанных();
	Для Каждого СтрокаХраненияБД Из СтруктураХраненияБазыДанных Цикл
		НайденныеМетоданные1С= Справочники.Методанные1С.НайтиПоРеквизиту("Метаданные", СтрокаХраненияБД.Метаданные, ,
			Объект.Ссылка);
		Если Не ЗначениеЗаполнено(НайденныеМетоданные1С) Тогда
			Продолжить;
		КонецЕсли;

		Методанные1С= НайденныеМетоданные1С.ПолучитьОбъект();
		Методанные1С.ИмяТаблицыХранения= СтрокаХраненияБД.ИмяТаблицыХранения;
		Методанные1С.Назначение= СтрокаХраненияБД.Назначение;
		Методанные1С.Записать();

		Для Каждого СтрокаПоляБД Из СтрокаХраненияБД.Поля Цикл
			НайденноеПоле= Справочники.Поля.НайтиПоНаименованию(СтрокаПоляБД.ИмяПоля, Истина, , Методанные1С.Ссылка);
			Если Не ЗначениеЗаполнено(НайденноеПоле) Тогда
				Продолжить;
			КонецЕсли;
			Поле= НайденноеПоле.ПолучитьОбъект();
			Поле.ИмяХранения= СтрокаПоляБД.ИмяПоляХранения;
			Поле.Записать();
			Для Каждого СтрокаПоляБД Из СтрокаХраненияБД.Индексы Цикл
				ИмяИндексаХранения= СтрокаПоляБД.ИмяИндексаХранения;
				Для Каждого ПолеИндекса Из СтрокаПоляБД.Поля Цикл
					ИмяПоляИндексаХранения= ПолеИндекса[0];
					ИмяПоляИндекса= ПолеИндекса[1];
					НайденноеПоле= Справочники.ПоляИндексов.НайтиПоНаименованию(ИмяПоляИндекса, Истина, , Поле.Ссылка);
					Если Не ЗначениеЗаполнено(НайденноеПоле) Тогда
						Продолжить;
					КонецЕсли;
					ПолеИндекса= НайденноеПоле.ПолучитьОбъект();
					ПолеИндекса.ИмяХранения= ИмяИндексаХранения;
					ПолеИндекса.Записать();
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры
